# GetTaggedLocalElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..GetTaggedLocalElementIds Method
IndependentTag Class See Also
---
Returns a set of IDs for all tagged local elements, if any. A local element ID will be provided for each subelement that is being referenced by the tag. Set of all the element ids in the local file. For each subelement a local element id will be provided.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ISet<ElementId> GetTaggedLocalElementIds()
```

Visual Basic
---
```text
Public Function GetTaggedLocalElementIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetTaggedLocalElementIds()
```

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace